{
  "common": {
    "title": "Num12",
    "ok": "Ok",
    "back": "Back",
    "save": "Save",
    "cancel": "Cancel",
    "close": "Close",
    "apply": "Apply",
    "home": "Home",
    "play": "Play",
    "newGame": "New game",
    "menu": "Menu",
    "continue": "Continue",
    "pause": "Pause",
    "settings": "Settings",
    "stars": "Stars",
    "help": "Help",
    "gameMenu": "Game menu",
    "hardChoose": "Hard choose",
    "leftSteps": "Steps",
    "score": "Score",
    "times": "Times",
    "moreComing": "More coming",
    "aboutAndContact": "About & Contact",
    "gameOver": "Game over",
    "continueOrMenu": "Continue or back to menu?",
    "got": "Got",
    "starter": "Starter",
    "normal": "Normal",
    "master": "Master"
  },
  "gameName": {
    "slider": "Slider",
    "nPuzzle": "N-Puzzle",
    "n2048": "2048",
    "numGuess": "Number Guess",
    "sudoku": "Sudoku",
    "numBattle": "Num Battle"
  },
  "k": {
    "title": "NUM12",
    "nav": {
      "dashboard": "Dashboard",
      "introduce": "Introduce",
      "history": "History",
      "world": "World",
      "games": "Games"
    },
    "introduce": {
      "title": "Numbers: The Evolution from Ancient Origins to Entertaining Games",
      "descriptions": [
        "As early as in the oracle bone inscriptions of the Yin and Shang Dynasties in China, the embryonic form of numbers had already emerged. At that time, the writing of numbers was relatively simple and intuitive. There were corresponding symbols for numbers from one to ten. Most of these symbols reflected the size of the numbers by the number of engraved lines. For example, 'one' was represented by one horizontal line, and 'two' was represented by two horizontal lines, and so on. As time went by, during the Spring and Autumn Period and the Warring States Period, the counting rod method was widely used. Counting rods were small sticks of the same length, and different combinations of their vertical and horizontal arrangements were used to represent different numbers. This counting method played a crucial role in many fields such as commercial trade, astronomical calendar calculation, and engineering construction at that time, laying a solid foundation for the development of ancient Chinese mathematics.",
        "The ancient Egyptians created hieroglyphic numbers. They used different graphic symbols to represent different numbers. For example, a vertical line represented '1', a horseshoe-shaped symbol represented '10', and a lotus pattern represented '100', and so on. These hieroglyphic numbers were vivid, but they were rather cumbersome when writing and calculating complex quantities. The ancient Babylonians adopted cuneiform numbers, using specific combinations of cuneiform notches to express values. This number system played an important role in fields such as commercial and astronomical calculations at that time.",
        "In India, a significant breakthrough in the development of numbers occurred. The Indians invented a set of number symbols including '0'. These numbers were concise and had a strong systematic nature. Later, through the spread by the Arabs, they were accepted and widely used by Europeans, and finally became the Arabic numerals that are now commonly used all over the world. Arabic numerals, with their advantages of being simple, clear, easy to write and calculate, have completely changed the way of mathematical operations and records in the world.",
        "Besides the above common ways of writing numbers, Roman numerals also occupied an important position in European history. Roman numerals use combinations of letters. For example, 'I' represents '1', 'V' represents '5', 'X' represents '10', 'L' represents '50', and so on. Different numbers are represented through specific addition and subtraction rules. For example, 'IV' represents '4', and 'IX' represents '9'. Roman numerals are still used in aspects such as architecture and clock scales today, and their unique writing forms demonstrate the charm of ancient European culture.",
        "With the continuous development and popularization of numbers, games based on numbers have emerged and flourished. Sudoku is a classic among number games. In a 9×9 Sudoku grid, based on the known numbers, players need to use logical reasoning and the method of elimination to fill the nine numbers from 1 to 9 into each small 3×3 grid as well as each row and each column without repetition. Sudoku not only tests players' patience but also greatly exercises the logical thinking ability of the brain. Both children and adults can find fun and challenges in it.",
        "There are also a wide variety of number puzzle games. Some games will give a series of number sequences, and players need to find the patterns among them to infer the next number or the missing numbers. Such games can stimulate players' keen insight into number patterns and cultivate their mathematical intuition. There is also the number sequence game, where players need to connect numbers according to specific rules, such as the difference or multiple relationship between adjacent numbers. This requires players to have a clear understanding of the order and relationship of numbers.",
        "In addition, there are number coloring games. Using numbers as indexes corresponding to different color areas, players complete beautiful patterns during the coloring process. This kind of game combines numbers with artistic creation, which is quite interesting. In the field of video games, in role-playing games with numbers as the core element, players need to pay attention to various numerical attributes of characters, such as health points, magic points, attack power, defense power and other numerical indicators, and improve these numbers by leveling up, obtaining equipment and other means, so as to embark on a wonderful adventure journey in the game world.",
        "From the simple counting in ancient times to the rich and diverse number games nowadays, numbers have been constantly evolving and innovating in the long river of human civilization. They have not only witnessed the development of human wisdom but also brought endless fun and challenges to people's lives."
      ]
    },
    "singleNum": {
      "title": "Single number",
      "text": "数字12是一款集合了多种数字游戏的游戏，包括数独、猜数字、滑动吧数字、数字华容道、2048等。"
    },
    "numGames": {
      "title": "Number games",
      "text": "数字12是一款集合了多种数字游戏的游戏，包括数独、猜数字、滑动吧数字、数字华容道、2048等。"
    }
  },
  "gameOver": {
    "gameOver": "Game over!",
    "timesOver": "There are no more moves!",
    "winWin": "Congratulations! Win!"
  },
  "sudoku": {
    "name": "Sudoku",
    "helpGoalTitle": "Goal",
    "helpGoalText": "Fill in a 9×9 grid with digits so that each column, row, and 3×3 section contain the numbers between 1 to 9.",
    "helpPlayTitle": "Play",
    "helpPlayText": "In a new game start, the 9×9 grid will have some of the squares filled in. You can use logic to fill in the missing digits and complete the grid.",
    "helpLiTitle": "Don’t forget, error if bellow:",
    "helpLi1": "Any row contains more than one of the same number.",
    "helpLi2": "Any column contains more than one of the same number.",
    "helpLi3": "Any 3×3 grid contains more than one of the same number."
  },
  "guess": {
    "name": "Number Guess",
    "helpText1": "You need to guess 4 different numbers.",
    "helpText2": "Game will random 4 numbers.",
    "helpText3": "For example 5678. If you guess 0128, you can get 1A0B. If you guess 5627, you can get 2A1B",
    "helpText4": "Every game has 8 times to guess.",
    "helpText5": "Less times guessed right, more stars got."
  },
  "slide": {
    "name": "Slide",
    "helpText1": "You can use a finger swipe to look for more than three pieces of digital color that are connected together and erase it."
  },
  "nPuzzle": {
    "nameB": "N-Puzzle"
  },
  "2048": {
    "nameB": "2048"
  },
  "stars": {
    "name": "Stars",
    "allStarts": "All stars",
    "gameStarts": "Game stars",
    "total": "Total",
    "quantityAvailableStar": "Quantity available stars"
  },
  "settings": {
    "name": "Settings",
    "onlyGame": "Only show game."
  },
  "more": {
    "name": "More",
    "about": {
      "title": "About",
      "version": "Version: ",
      "author": "Author: Bob Liu (Bob Game)",
      "desc1": "This is my own practice coding work, all free, no paid content, I hope players like to play."
    }
  },
  "dialog": {
    "lang": {
      "title": "Language",
      "desc": "Please choose your language and apply it."
    }
  }
}